In [419]:
import pandas as pd
import numpy as np

In [420]:
df=pd.DataFrame(data=np.random.randint(0,10,size=(3,4)),columns=list('ABCD'))
df

   A  B  C  D
0  5  7  7  9
1  2  7  9  2
2  6  9  6  2

In [421]:
df+10

    A   B   C   D
0  15  17  17  19
1  12  17  19  12
2  16  19  16  12

In [422]:
arr1=np.array([1,2,3,4])
arr1

array([1, 2, 3, 4])

In [423]:
df+arr1

   A   B   C   D
0  6   9  10  13
1  3   9  12   6
2  7  11   9   6

In [424]:
s=pd.Series(data=[1,2,3,4],index=list('ABCD'))
s

A    1
B    2
C    3
D    4
dtype: int64

In [425]:
df

   A  B  C  D
0  5  7  7  9
1  2  7  9  2
2  6  9  6  2

In [426]:
df+s

   A   B   C   D
0  6   9  10  13
1  3   9  12   6
2  7  11   9   6

In [427]:
s1=pd.Series(data=[1,2,3,4],index=[1,2,3,4])
s1

1    1
2    2
3    3
4    4
dtype: int64

In [428]:
df+s1

    A   B   C   D   1   2   3   4
0 NaN NaN NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN NaN NaN

In [429]:
df

   A  B  C  D
0  5  7  7  9
1  2  7  9  2
2  6  9  6  2

In [430]:
s=pd.Series(data=[1,2,3],index=[0,1,2])
s

0    1
1    2
2    3
dtype: int64

In [431]:
df.add(s, axis='index')

   A   B   C   D
0  6   8   8  10
1  4   9  11   4
2  9  12   9   5

In [432]:
df1=pd.DataFrame(data=np.random.randint(0,10,size=(3,3)),columns=list('ABC'))
df2=pd.DataFrame(data=np.random.randint(0,10,size=(2,2)),columns=list('BA'))
display(df1,df2)

   A  B  C
0  8  3  0
1  7  4  1
2  9  1  5

   B  A
0  9  7
1  0  1

In [433]:
df1+df2

      A     B   C
0  15.0  12.0 NaN
1   8.0   4.0 NaN
2   NaN   NaN NaN

In [434]:
df1.add(df2,fill_value=0)

      A     B    C
0  15.0  12.0  0.0
1   8.0   4.0  1.0
2   9.0   1.0  5.0

### 代码解释
这段代码使用 pandas 的 `add` 方法对两个 `DataFrame` 对象 `df1` 和 `df2` 进行元素级相加操作。
由于 `df1` 和 `df2` 的形状和索引不完全匹配，`add` 方法通过参数 `fill_value=0` 指定在缺失值的位置填充为 0。
最终的结果是将两个 `DataFrame` 中对应位置的值相加，缺失值用 0 替代。

In [435]:
arr=np.random.randint(-10,10,size=(3,3))
arr

array([[-3,  6,  5],
       [-9, -6, -4],
       [ 6, -4, -9]])

In [436]:
df=pd.DataFrame(data=arr)
df

   0  1  2
0 -3  6  5
1 -9 -6 -4
2  6 -4 -9

In [437]:
np.abs(df)

   0  1  2
0  3  6  5
1  9  6  4
2  6  4  9

In [438]:
df

   0  1  2
0 -3  6  5
1 -9 -6 -4
2  6 -4 -9

In [ ]:
df.T#转置

   0  1  2
0 -3 -9  6
1  6 -6 -4
2  5 -4 -9